app/controllers/orders_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 30 LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1 ORDER BY `orders`.`id` ASC LIMIT 1
---
  def download_csv
    @user = User.find(params[:user_id])
    @orders = Order.where(user_id: params[:user_id])