app/models/order.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 65
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 11 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 65 LIMIT 1
---
  def self.to_csv
    attributes = %w[USERNAME USER_EMAIL PRODUCT_CODE PRODUCT_NAME PRODUCT_CATEGORY ORDER_DATE]
    CSV.generate(headers: true) do |csv|
      csv << attributes
      all.each do |order|
        csv << [order.user.username,order.user.email,order.product.code,order.product.name,order.product.category,order.order_date]